yingshaoxo/super_led_fan/MSP430F169/main.c
            for (k = 0; k < 16; k++) { //写一整行数据
                write_data(0x00);
                millisecond_of_delay(1);
            }
        }
    }

    write_command(0x30); //关闭扩展指令集
}

void draw_graph(const unsigned char *graphic) {
    force_screen_clean();
    write_command(0x34); //开启扩展指令集，并关闭画图显示。

    unsigned char x, y;
    for (y = 0; y < 64; y++) {
        if (y < 32) {
            for (x = 0; x < 8; x++)                      // Draws top half of the screen.
            {                                            // In extended instruction mode, vertical and horizontal coordinates must be specified before sending data in.
                write_command(0x80 | y);                 // Vertical coordinate of the screen is specified first. (0-31)
                write_command(0x80 | x);                 // Then horizontal coordinate of the screen is specified. (0-8)
                write_data(graphic[2 * x + 16 * y]);     // Data to the upper byte is sent to the coordinate.
                write_data(graphic[2 * x + 1 + 16 * y]); // Data to the lower byte is sent to the coordinate.
            }
        } else {
            for (x = 0; x < 8; x++)             // Draws bottom half of the screen.
            {                                   // Actions performed as same as the upper half screen.
                write_command(0x80 | (y - 32)); // Vertical coordinate must be scaled back to 0-31 as it is dealing with another half of the screen.
                write_command(0x88 | x);
                write_data(graphic[2 * x + 16 * y]);
                write_data(graphic[2 * x + 1 + 16 * y]);
            }
        }
    }

    write_command(0x36); //开显示
    write_command(0x30); //转回基本指令集
}

void initialize_LCD() {
    P1DIR = 0xFF;
    P1OUT = 0x00;

    millisecond_of_delay(1000); // delay for LCD to wake up

    write_command(0x30); // 30=0011 0000; use `basic instruction mode`, use
                         // `8-BIT interface`
    millisecond_of_delay(20);
    write_command(0x0c); // 0c=0000 1100; DISPLAY ON, cursor OFF, blink OFF
    millisecond_of_delay(20);
    write_command(0x01); // 0c=0000 0001; CLEAR

    millisecond_of_delay(200);
}

// ***************
// ****************
//
// Handle keypad value !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// ***************
// ****************

/* 
1	2	3	Return(or back)
4	5	6	Menu
7	8	9	Cancel
    0	.	Enter

.: 10
Return: 11
Menu: 12
Cancel: 13
Enter: 14
*/

char input_string[50];

int start_to_set_task = 0;
int task_number_from_keypad = 0;

int start_to_set_row1 = 0;
int start_to_set_row2 = 0;
int row1_for_task1 = 0;
int row2_for_task1 = 0;
void handle_keypad_key(int number) {
    if (start_to_set_row1 == 1) {
        if ((number >= 0) && (number < 10)) {
            char text[1];
            int_to_string(number, text, 1);
            strcat(input_string, text);
            print_string(0, 1, input_string);
        } else if (number > 10) {
            if (number == 13) {
                print_string(0, 1, "Row1(0-15)?");
                strcpy(input_string, "");
            } else if (number == 14) {
                int target_number = atoi(input_string);
                row1_for_task1 = target_number;
                start_to_set_row1 = 0;
                start_to_set_row2 = 1;

                print_string(0, 1, "Row2(0-15)?");
                strcpy(input_string, "");
            }
        }
        return;
    }

    if (start_to_set_row2 == 1) {
        if ((number >= 0) && (number < 10)) {
            char text[1];
            int_to_string(number, text, 1);
            strcat(input_string, text);
            print_string(0, 1, input_string);
        } else if (number > 10) {
            if (number == 13) {
                print_string(0, 1, "Row2(0-15)?");
                strcpy(input_string, "");
            } else if (number == 14) {
                int target_number = atoi(input_string);
                row2_for_task1 = target_number;
                start_to_set_row1 = 0;
                start_to_set_row2 = 0;

                print_string(0, 1, "Which Task?");
                strcpy(input_string, "");
            }
        }
        return;
    }

    if (start_to_set_task == 0) {
        screen_clean();
        millisecond_of_delay(10);
        if ((number >= 0) && (number < 10)) {
            char text[1];
            int_to_string(number, text, 1);
            strcat(input_string, text);
            print_string(0, 1, input_string);

            start_to_set_task = 1;
        }
    } else if (start_to_set_task == 1) {
        if ((number >= 0) && (number < 10)) {
            print_string(0, 1, "Which Task?");
            strcpy(input_string, "");
            start_to_set_task = 0;
        } else if (number > 10) {
            if (number == 13) {
                print_string(0, 1, "Which Task?");
                strcpy(input_string, "");
                start_to_set_task = 0;

            } else if (number == 14) {
                int target_number = atoi(input_string);
                if (target_number != 1) {
                    task_number_from_keypad = target_number;

                    print_string(0, 1, "Which Task?");
                    strcpy(input_string, "");
                    start_to_set_task = 0;
                } else {
                    task_number_from_keypad = target_number;
                    start_to_set_row1 = 1;

                    print_string(0, 1, "Row1(0-15)?");
                    strcpy(input_string, "");
                }
            }
        }
    }
}

// ***************
// ****************
// SET Serial Communication!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// TX(transmit): P3.4
// RX(receive): P3.5
//
// One thing you have to know: Tx connect to Rx, Rx connect to Tx  !!!!!!!!!
//
// VCC: 3.3V
//
// ***************
// ****************

void initialize_serial_communication() {
    /* for 115200 baud */
    volatile unsigned int i;
    WDTCTL = WDTPW + WDTHOLD; // Stop WDT
    P3SEL |= 0x30;            // P3.4 and P3.5 = USART0 TXD/RXD

