yingshaoxo/super_led_fan/MSP430F169/main.c
    BCSCTL1 &= ~XT2OFF; // XT2on

    do {
        IFG1 &= ~OFIFG; // Clear OSCFault flag
        for (i = 0xFF; i > 0; i--)
            ;                 // Time for flag to set
    } while ((IFG1 & OFIFG)); // OSCFault flag still set?

    BCSCTL2 |= SELM_2 + SELS; // MCLK = SMCLK = XT2 (safe)
    ME1 |= UTXE0 + URXE0;     // Enable USART0 TXD/RXD
    UCTL0 |= CHAR;            // 8-bit character
    UTCTL0 |= SSEL1;          // UCLK = SMCLK
    UBR00 = 0x45;             // 8MHz 115200
    UBR10 = 0x00;             // 8MHz 115200
    UMCTL0 = 0x00;            // 8MHz 115200 modulation
    UCTL0 &= ~SWRST;          // Initialize USART state machine

    IE1 |= URXIE0; // Enable USART0 RX interrupt

    _BIS_SR(GIE); // just enable general interrupt
}

unsigned int STATE_YOU_WANT_TO_SEND = 0;
void send_state_to_serial(int state) {
    STATE_YOU_WANT_TO_SEND = state;
}

unsigned int STATE_FROM_SERIAL = 0;
unsigned int TASK_NUMBER = 0;

unsigned int data_arraving = 0;
unsigned int data_index = 0;

unsigned int an_image[257];
unsigned int image_index = 0;
unsigned int an_image_received = 0;

unsigned int KeyPad_value = 15; // 15 was not exist
unsigned int old_KeyPad_state = 0;
unsigned int new_KeyPad_state = 0;

#pragma vector = USART0RX_VECTOR
__interrupt void usart0_rx(void) {
    while (!(IFG1 & UTXIFG0)) {
        // USART0 TX buffer ready?
    }
    STATE_FROM_SERIAL = (int)RXBUF0; // receive state
    //TXBUF0 = (unsigned char)STATE_YOU_WANT_TO_SEND; // send state

    if (STATE_FROM_SERIAL != 0 || data_arraving == 1) {
        if (data_arraving == 0) {
            TASK_NUMBER = STATE_FROM_SERIAL;
            if (TASK_NUMBER == 8) {
                an_image_received = 0;
            }
            data_arraving = 1;

        } else {
            if (TASK_NUMBER == 8) {     // handle image data
                if (data_index < 256) { // data_index = 255, actually the 256 element
                    if (STATE_FROM_SERIAL == 9) {
                        an_image[data_index] = 1;
                    } else {
                        an_image[data_index] = 0;
                    }
                } else { // data_index == 256, actually the 257 element
                    image_index = STATE_FROM_SERIAL;
                }
            }
            if (TASK_NUMBER == 11) { // handle keypad data
                if (data_index == 0) {
                    KeyPad_value = STATE_FROM_SERIAL;
                }
                if (data_index == 1) {
                    new_KeyPad_state = STATE_FROM_SERIAL;
                }
            }

            data_index += 1;

            if (data_index > 256) {
                data_arraving = 0;
                data_index = 0;
                if (TASK_NUMBER == 8) { // handle image data after data transmission finished
                    an_image_received = 1;
                }
                if (TASK_NUMBER == 11) { // handle keypad data after data transmission finished
                    if (old_KeyPad_state != new_KeyPad_state) {
                        // do something
                        handle_keypad_key(KeyPad_value);
                    }
                    old_KeyPad_state = new_KeyPad_state;
                }
            }
        }
    } else {
        TASK_NUMBER = 0;
    }
}

// ***************
// ****************
//
// Display imgage at LCD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// ***************
// ****************

void draw_picture_from_serial() {
    // convert 16x16 points to 8x16
    unsigned char new_data[128];
    int new_data_index = 0;

    unsigned char y, x;
    for (y = 0; y < 16; y++) {
        for (x = 0; x < 16; x++) {
            if (x % 2 != 0) { // only work for odd index, for example, 1,3,5,7
                int first, second;
                first = an_image[(y * 16) + x];
                second = an_image[((y * 16) + x) - 1];
                if ((first == 0) && (second == 1)) {
                    new_data[new_data_index] = 0x0f;
                } else if ((first == 1) && (second == 0)) {
                    new_data[new_data_index] = 0xf0;
                } else if ((first == 1) && (second == 1)) {
                    new_data[new_data_index] = 0xff;
                } else if ((first == 0) && (second == 0)) {
                    new_data[new_data_index] = 0x00;
                }
                new_data_index++;
            }
        }
    }

    // start drawing
    force_screen_clean();
    write_command(0x34); //开启扩展指令集，并关闭画图显示。
    write_command(0x36); //开显示

    unsigned char i, ii, iii;
    for (i = 0; i < 16; i++) {
        if (i < 8) {
            for (ii = 0; ii < 4; ii++) {
                write_command(0x80 + ii + 4 * i);
                write_command(0x80);
                for (iii = 0; iii < 8; iii++) {
                    write_data(new_data[i * 8 + iii]);
                }
                for (iii = 0; iii < 8; iii++) {
                    write_data(0x00);
                }
            }
        } else {
            for (ii = 0; ii < 4; ii++) {
                write_command(0x80 + ii + 4 * i - 32);
                write_command(0x88);
                for (iii = 0; iii < 8; iii++) {
                    write_data(new_data[i * 8 + iii]);
                }
                for (iii = 0; iii < 8; iii++) {
                    write_data(0x00);
                }
            }
        }
    }

    write_command(0x30); //转回基本指令集
}

// ***************
// ****************
// SET Pin interrupt for getting base time T !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// infrared sensor pin: P1.3
//
// ***************
// ****************

#define echo_pin BIT3

void initialize_infrared_sensor() {
    P1DIR &= ~echo_pin; // set P1.3 as input

    TB0CCTL0 |= CCIE;         // Timer B Capture/Compare Control 0; CCR0 interrupt enabled
    TB0CCR0 = 50000;          // start to increase TBR microseconds
    TB0CTL = TBSSEL_2 + MC_1; // Timer B Control; SMCLK, UP mode

    P1IFG &= ~echo_pin; // interrupt flag: set to 0 to indicate No interrupt is pending
    P1IE |= echo_pin;   // interrupt enable: enable interrupt on pin1.3
    P1IES |= echo_pin;  // set P1 echo_pin to falling edge interrupt: P1IES = 1

    //_BIS_SR(GIE); // global interrupt enable
    __enable_interrupt(); // you must enable all interrupt for thie code to work
}

unsigned long int temporary_accumulated_T;
unsigned long int infrared_detection_counting = 0;
unsigned long int the_average_T = 0;                         //T
unsigned long int the_time_during_one_part_of_240_parts = 0; //T1
#pragma vector = PORT1_VECTOR
__interrupt void Port_1(void) {
    if (P1IFG & echo_pin) // is that interrupt request come from echo_pin? is there an rising or falling edge has been detected? Each PxIFGx bit is the interrupt flag for its corresponding I/O pin and is set when the selected input signal edge occurs at the pin.
    {
        if (P1IES & echo_pin) // is this the falling edge? (P1IES & echo_pin) == 1
        {
            if (infrared_detection_counting > 9) {
                temporary_accumulated_T += TB0R; // TBR is a us time unit at this case; may have error if change happens too fast; use array is a sulution
            }
            infrared_detection_counting++;
            if (infrared_detection_counting >= 19) {
                the_average_T = temporary_accumulated_T / 10;
                the_time_during_one_part_of_240_parts = the_average_T / 240;
                infrared_detection_counting == 0;
            }
            TB0CCR0 = 50000; // start to increase TBR microseconds
        }
        P1IFG &= ~echo_pin; // clear flag, so it can start to detect new rising or falling edge, then a new call to this interrupt function will be allowed.
    }
}

