yingshaoxo/super_led_fan/MSP430F169/main.c
#pragma vector = TIMER0_B0_VECTOR
__interrupt void Timer_B(void) {
    // don't know why this have to be exist, but without it, TBR won't work
}

// ***************
// ****************
// Control the LEDs !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
// data: P5.0-P5.7
// enable: P6.0-P6.3
//
// ***************
// ****************

#define enable_led_chip_1 P6OUT |= BIT0
#define disable_led_chip_1 P6OUT &= ~BIT0

#define enable_led_chip_2 P6OUT |= BIT1
#define disable_led_chip_2 P6OUT &= ~BIT1

#define enable_led_chip_3 P6OUT |= BIT2
#define disable_led_chip_3 P6OUT &= ~BIT2

#define enable_led_chip_4 P6OUT |= BIT3
#define disable_led_chip_4 P6OUT &= ~BIT3

void initialize_16_rows_LED() {
    P5DIR |= (BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7); // set Port 5 as output
    P6DIR |= (BIT0 | BIT1 | BIT2 | BIT3);                             // set P6.0-P6.3 as output

    P5OUT &= ~(BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7); // set Port 5 to low
    P6OUT &= ~(BIT0 | BIT1 | BIT2 | BIT3);                             // set P6.0-P6.3 to low
}

unsigned char int_to_led_hex(int number) {
    switch (number) {
    case 0:
        return 0x80;
    case 1:
        return 0x40;
    case 2:
        return 0x20;
    case 3:
        return 0x10;
    case 4:
        return 0x08;
    case 5:
        return 0x04;
    case 6:
        return 0x02;
    case 8:
        return 0x01;
    default:
        return 0x00;
    }
}

void set_first_8_red_leds(unsigned char byte_data) {
    enable_led_chip_1;
    P5OUT = byte_data;
    disable_led_chip_1;
}

void set_first_8_green_leds(unsigned char byte_data) {
    enable_led_chip_2;
    P5OUT = byte_data;
    disable_led_chip_1;
}

void set_second_8_red_leds(unsigned char byte_data) {
    enable_led_chip_3;
    P5OUT = byte_data;
    disable_led_chip_1;
}

void set_second_8_green_leds(unsigned char byte_data) {
    enable_led_chip_4;
    P5OUT = byte_data;
    disable_led_chip_1;
}

void turn_off_all_leds() {
    P5OUT = 0x00;
}

// ****************

// Task 1

// ****************

void task_1(row_1, row_2) {
    // the number is between 0 and 15
    if ((row_1 < 8) && (row_2 < 8)) {
        set_first_8_red_leds(int_to_led_hex(row_1) | int_to_led_hex(row_2));
    } else if ((row_1 > 7) && (row_2 > 7)) {
        set_second_8_red_leds(int_to_led_hex(row_1) | int_to_led_hex(row_2));
    } else if ((row_1 < 8) && (row_2 > 7)) {
        set_first_8_red_leds(int_to_led_hex(row_1));
        set_second_8_red_leds(int_to_led_hex(row_2));
    } else if ((row_1 > 7) && (row_2 < 8)) {
        set_second_8_red_leds(int_to_led_hex(row_1));
        set_first_8_red_leds(int_to_led_hex(row_2));
    }
}

// ****************

// Task 2

// ****************

int main(void) {
    WDTCTL = WDTPW | WDTHOLD; // stop watchdog timer

    initialize_LCD();
    initialize_serial_communication();
    initialize_infrared_sensor();

    print_string(0, 1, "Which Task?");
    //int i = 0;
    while (1) {
        //print_number(0, 1, TASK_NUMBER);
        //print_number(0, 2, an_image_received);
        //print_number(0, 3, image_index);
        //print_number(0, 4, STATE_FROM_SERIAL);
        ////print_number(0, 4, i);
        //millisecond_of_delay(500);
        //screen_clean();

        //i++;
        //if (i > 50) {
        //    i = 0;
        //}

        //if (an_image_received == 1) {
        //    draw_picture_from_serial();

        //    an_image_received = 0;
        //}
        print_number(0, 2, task_number_from_keypad);
        print_number(0, 3, row1_for_task1);
        print_number(0, 4, row2_for_task1);
    }

    return 0;
}